tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1705_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1705_H_
#define _PIC16LF1705_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define CCP1IF                        52
#define CCPIF                         53
#define SSP1IF                        54
#define TXIF                          55
#define RCIF                          56
#define ADIF                          57
#define TMR1GIF                       58
#define PIR2                          59
#define CCP2IF                        60
#define TMR4IF                        61
#define TMR6IF                        62
#define BCL1IF                        63
#define C1IF                          64
#define C2IF                          65
#define OSFIF                         66
#define PIR3                          67
#define CLC1IF                        68
#define CLC2IF                        69
#define CLC3IF                        70
#define ZCDIF                         71
#define COGIF                         72
#define TMR0                          73
#define TMR1L                         74
#define TMR1H                         75
#define T1CON                         76
#define TMR1ON                        77
#define nT1SYNC                       78
#define T1OSCEN                       79
#define T1CKPS0                       80
#define T1CKPS                        81
#define T1CKPS1                       82
#define TMR1CS0                       83
#define TMR1CS                        84
#define TMR1CS1                       85
#define T1GCON                        86
#define T1GSS0                        87
#define T1GSS                         88
#define T1GSS1                        89
#define T1GVAL                        90
#define T1GGO_nDONE                   91
#define T1GSPM                        92
#define T1GTM                         93
#define T1GPOL                        94
#define TMR1GE                        95
#define TMR2                          96
#define PR2                           97
#define T2CON                         98
#define T2CKPS0                       99
#define T2CKPS                        100
#define T2CKPS1                       101
#define TMR2ON                        102
#define T2OUTPS0                      103
#define T2OUTPS                       104
#define T2OUTPS1                      105
#define T2OUTPS2                      106
#define T2OUTPS3                      107
#define TRISA                         108
#define TRISA0                        109
#define TRISA1                        110
#define TRISA2                        111
#define TRISA4                        112
#define TRISA5                        113
#define TRISC                         114
#define TRISC0                        115
#define TRISC1                        116
#define TRISC2                        117
#define TRISC3                        118
#define TRISC4                        119
#define TRISC5                        120
#define PIE1                          121
#define TMR1IE                        122
#define TMR2IE                        123
#define CCP1IE                        124
#define CCPIE                         125
#define SSP1IE                        126
#define TXIE                          127
#define RCIE                          128
#define ADIE                          129
#define TMR1GIE                       130
#define PIE2                          131
#define CCP2IE                        132
#define TMR4IE                        133
#define TMR6IE                        134
#define BCL1IE                        135
#define C1IE                          136
#define C2IE                          137
#define OSFIE                         138
#define PIE3                          139
#define CLC1IE                        140
#define CLC2IE                        141
#define CLC3IE                        142
#define ZCDIE                         143
#define COGIE                         144
#define OPTION_REG                    145
#define PS                            146
#define PS0                           147
#define PS1                           148
#define PS2                           149
#define PSA                           150
#define T0SE                          151
#define TMR0SE                        152
#define T0CS                          153
#define TMR0CS                        154
#define INTEDG                        155
#define nWPUEN                        156
#define PCON                          157
#define nBOR                          158
#define nPOR                          159
#define nRI                           160
#define nRMCLR                        161
#define nRWDT                         162
#define STKUNF                        163
#define STKOVF                        164
#define WDTCON                        165
#define SWDTEN                        166
#define WDTPS                         167
#define WDTPS0                        168
#define WDTPS1                        169
#define WDTPS2                        170
#define WDTPS3                        171
#define WDTPS4                        172
#define OSCTUNE                       173
#define TUN0                          174
#define TUN                           175
#define TUN1                          176
#define TUN2                          177
#define TUN3                          178
#define TUN4                          179
#define TUN5                          180
#define OSCCON                        181
#define SCS0                          182
#define SCS                           183
#define SCS1                          184
#define IRCF                          185
#define IRCF0                         186
#define IRCF1                         187
#define IRCF2                         188
#define IRCF3                         189
#define SPLLEN                        190
#define OSCSTAT                       191
#define HFIOFS                        192
#define LFIOFR                        193
#define MFIOFR                        194
#define HFIOFL                        195
#define HFIOFR                        196
#define OSTS                          197
#define PLLR                          198
#define SOSCR                         199
#define ADRESL                        200
#define ADRESH                        201
#define ADCON0                        202
#define ADON                          203
#define GO_nDONE                      204
#define GO                            205
#define ADGO                          206
#define CHS0                          207
#define CHS                           208
#define CHS1                          209
#define CHS2                          210
#define CHS3                          211
#define CHS4                          212
#define ADCON1                        213
#define ADPREF0                       214
#define ADPREF                        215
#define ADPREF1                       216
#define ADNREF                        217
#define ADCS                          218
#define ADFM                          219
#define ADCON2                        220
#define TRIGSEL                       221
#define TRIGSEL0                      222
#define TRIGSEL1                      223
#define TRIGSEL2                      224
#define TRIGSEL3                      225
#define LATA                          226
#define LATA0                         227
#define LATA1                         228
#define LATA2                         229
#define LATA4                         230
#define LATA5                         231
#define LATC                          232
#define LATC0                         233
#define LATC1                         234
#define LATC2                         235
#define LATC3                         236
#define LATC4                         237
#define LATC5                         238
#define CM1CON0                       239
#define C1SYNC                        240
#define C1HYS                         241
#define C1SP                          242
#define C1ZLF                         243
#define C1POL                         244
#define C1OUT                         245
#define C1ON                          246
#define CM1CON1                       247
#define C1NCH0                        248
#define C1NCH                         249
#define C1NCH1                        250
#define C1NCH2                        251
#define C1PCH                         252
#define C1PCH0                        253
#define C1PCH1                        254
#define C1PCH2                        255
#define C1INTN                        256
#define C1INTP                        257
#define CM2CON0                       258
#define C2SYNC                        259
#define C2HYS                         260
#define C2SP                          261
#define C2ZLF                         262
#define C2POL                         263
#define C2OUT                         264
#define C2ON                          265
#define CM2CON1                       266
#define C2NCH0                        267
#define C2NCH                         268
#define C2NCH1                        269
#define C2NCH2                        270
#define C2PCH                         271
#define C2PCH0                        272
#define C2PCH1                        273
#define C2PCH2                        274
#define C2INTN                        275
#define C2INTP                        276
#define CMOUT                         277
#define MC1OUT                        278
#define MC2OUT                        279
#define BORCON                        280
#define BORRDY                        281
#define BORFS                         282
#define SBOREN                        283
#define FVRCON                        284
#define ADFVR0                        285
#define ADFVR                         286
#define ADFVR1                        287
#define CDAFVR                        288
#define CDAFVR0                       289
#define CDAFVR1                       290
#define TSRNG                         291
#define TSEN                          292
#define FVRRDY                        293
#define FVREN                         294
#define DAC1CON0                      295
#define DACNSS                        296
#define DAC1NSS                       297
#define DACPSS                        298
#define DACPSS0                       299
#define DAC1PSS                       300
#define DAC1PSS0                      301
#define DACPSS1                       302
#define DAC1PSS1                      303
#define DACOE0                        304
#define DAC1OE2                       305
#define DAC1OE1                       306
#define DACOE1                        307
#define DACEN                         308
#define DAC1EN                        309
#define DAC1CON1                      310
#define DAC1R                         311
#define DACR0                         312
#define DAC1R0                        313
#define DACR1                         314
#define DAC1R1                        315
#define DACR2                         316
#define DAC1R2                        317
#define DACR3                         318
#define DAC1R3                        319
#define DACR4                         320
#define DAC1R4                        321
#define DACR5                         322
#define DAC1R5                        323
#define DACR6                         324
#define DAC1R6                        325
#define DACR7                         326
#define DAC1R7                        327
#define ZCD1CON                       328
#define ZCD1INTN                      329
#define ZCD1INTP                      330
#define ZCD1POL                       331
#define ZCD1OUT                       332
#define ZCD1EN                        333
#define ANSELA                        334
#define ANSA0                         335
#define ANSA1                         336
#define ANSA2                         337
#define ANSA4                         338
#define ANS5                          339
#define ANSELC                        340
#define ANSC0                         341
#define ANSC1                         342
#define ANSC2                         343
#define ANSC3                         344
#define ANSC4                         345
#define ANSC5                         346
#define PMADRL                        347
#define PMADRH                        348
#define PMDATL                        349
#define PMDATH                        350
#define PMCON1                        351
#define RD                            352
#define WR                            353
#define WREN                          354
#define WRERR                         355
#define FREE                          356
#define LWLO                          357
#define CFGS                          358
#define PMCON2                        359
#define RC1REG                        360
#define TX1REG                        361
#define SP1BRGL                       362
#define SP1BRGH                       363
#define RC1STA                        364
#define RX9D                          365
#define OERR                          366
#define FERR                          367
#define ADDEN                         368
#define CREN                          369
#define SREN                          370
#define RX9                           371
#define SPEN                          372
#define TX1STA                        373
#define TX9D                          374
#define TRMT                          375
#define BRGH                          376
#define SENDB                         377
#define SYNC                          378
#define TXEN                          379
#define TX9                           380
#define CSRC                          381
#define BAUD1CON                      382
#define ABDEN                         383
#define WUE                           384
#define BRG16                         385
#define SCKP                          386
#define RCIDL                         387
#define ABDOVF                        388
#define WPUA                          389
#define WPUA0                         390
#define WPUA1                         391
#define WPUA2                         392
#define WPUA3                         393
#define WPUA4                         394
#define WPUA5                         395
#define WPUC                          396
#define WPUC0                         397
#define WPUC1                         398
#define WPUC2                         399
#define WPUC3                         400
#define WPUC4                         401
#define WPUC5                         402
#define SSP1BUF                       403
#define BUF                           404
#define BUF0                          405
#define SSP1BUF0                      406
#define BUF1                          407
#define SSP1BUF1                      408
#define BUF2                          409
#define SSP1BUF2                      410
#define BUF3                          411
#define SSP1BUF3                      412
#define BUF4                          413
#define SSP1BUF4                      414
#define BUF5                          415
#define SSP1BUF5                      416
#define BUF6                          417
#define SSP1BUF6                      418
#define BUF7                          419
#define SSP1BUF7                      420
#define ADD0                          421
#define ADD                           422
#define SSP1ADD0                      423
#define SSP1ADD                       424
#define ADD1                          425
#define SSP1ADD1                      426
#define ADD2                          427
#define SSP1ADD2                      428
#define ADD3                          429
#define SSP1ADD3                      430
#define ADD4                          431
#define SSP1ADD4                      432
#define ADD5                          433
#define SSP1ADD5                      434
#define ADD6                          435
#define SSP1ADD6                      436
#define ADD7                          437
#define SSP1ADD7                      438
#define SSP1MSK0                      439
#define SSP1MSK                       440
#define MSK0                          441
#define MSK                           442
#define SSP1MSK1                      443
#define MSK1                          444
#define SSP1MSK2                      445
#define MSK2                          446
#define SSP1MSK3                      447
#define MSK3                          448
#define SSP1MSK4                      449
#define MSK4                          450
#define SSP1MSK5                      451
#define MSK5                          452
#define SSP1MSK6                      453
#define MSK6                          454
#define SSP1MSK7                      455
#define MSK7                          456
#define SSP1STAT                      457
#define BF                            458
#define UA                            459
#define R_nW                          460
#define S                             461
#define P                             462
#define D_nA                          463
#define CKE                           464
#define SMP                           465
#define SSP1CON1                      466
#define SSPM0                         467
#define SSPM                          468
#define SSPM1                         469
#define SSPM2                         470
#define SSPM3                         471
#define CKP                           472
#define SSPEN                         473
#define SSPOV                         474
#define WCOL                          475
#define SSP1CON2                      476
#define SEN                           477
#define RSEN                          478
#define PEN                           479
#define RCEN                          480
#define ACKEN                         481
#define ACKDT                         482
#define ACKSTAT                       483
#define GCEN                          484
#define SSP1CON3                      485
#define DHEN                          486
#define AHEN                          487
#define SBCDE                         488
#define SDAHT                         489
#define BOEN                          490
#define SCIE                          491
#define PCIE                          492
#define ACKTIM                        493
#define ODCONA                        494
#define ODA0                          495
#define ODA1                          496
#define ODA2                          497
#define ODA4                          498
#define ODA5                          499
#define ODCONC                        500
#define ODC0                          501
#define ODC1                          502
#define ODC2                          503
#define ODC3                          504
#define ODC4                          505
#define ODC5                          506
#define CCPR1L                        507
#define CCPR1H                        508
#define CCP1CON                       509
#define CCP1M0                        510
#define CCP1M                         511
#define CCP1M1                        512
#define CCP1M2                        513
#define CCP1M3                        514
#define CCP1Y                         515
#define DC1B                          516
#define DC1B0                         517
#define CCP1X                         518
#define DC1B1                         519
#define CCPR2L                        520
#define CCPR2H                        521
