tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1705_tdd.h
#define CCP2CON                       522
#define CCP2M                         523
#define CCP2M0                        524
#define CCP2M1                        525
#define CCP2M2                        526
#define CCP2M3                        527
#define DC2B0                         528
#define CCP2Y                         529
#define DC2B                          530
#define DC2B1                         531
#define CCP2X                         532
#define CCPTMRS                       533
#define C1TSEL0                       534
#define C1TSEL                        535
#define C1TSEL1                       536
#define C2TSEL0                       537
#define C2TSEL                        538
#define C2TSEL1                       539
#define P3TSEL                        540
#define P3TSEL0                       541
#define P3TSEL1                       542
#define P4TSEL0                       543
#define P4TSEL                        544
#define P4TSEL1                       545
#define SLRCONA                       546
#define SLRA0                         547
#define SLRA1                         548
#define SLRA2                         549
#define SLRA4                         550
#define SLRA5                         551
#define SLRCONC                       552
#define SLRC0                         553
#define SLRC1                         554
#define SLRC2                         555
#define SLRC3                         556
#define SLRC4                         557
#define SLRC5                         558
#define INLVLA                        559
#define INLVLA0                       560
#define INLVLA1                       561
#define INLVLA2                       562
#define INLVLA3                       563
#define INLVLA4                       564
#define INLVLA5                       565
#define INLVLC                        566
#define INLVLC0                       567
#define INLVLC1                       568
#define INLVLC2                       569
#define INLVLC3                       570
#define INLVLC4                       571
#define INLVLC5                       572
#define IOCAP                         573
#define IOCAP0                        574
#define IOCAP1                        575
#define IOCAP2                        576
#define IOCAP3                        577
#define IOCAP4                        578
#define IOCAP5                        579
#define IOCAN                         580
#define IOCAN0                        581
#define IOCAN1                        582
#define IOCAN2                        583
#define IOCAN3                        584
#define IOCAN4                        585
#define IOCAN5                        586
#define IOCAF                         587
#define IOCAF0                        588
#define IOCAF1                        589
#define IOCAF2                        590
#define IOCAF3                        591
#define IOCAF4                        592
#define IOCAF5                        593
#define IOCCP                         594
#define IOCCP0                        595
#define IOCCP1                        596
#define IOCCP2                        597
#define IOCCP3                        598
#define IOCCP4                        599
#define IOCCP5                        600
#define IOCCN                         601
#define IOCCN0                        602
#define IOCCN1                        603
#define IOCCN2                        604
#define IOCCN3                        605
#define IOCCN4                        606
#define IOCCN5                        607
#define IOCCF                         608
#define IOCCF0                        609
#define IOCCF1                        610
#define IOCCF2                        611
#define IOCCF3                        612
#define IOCCF4                        613
#define IOCCF5                        614
#define TMR4                          615
#define PR4                           616
#define T4CON                         617
#define T4CKPS0                       618
#define T4CKPS                        619
#define T4CKPS1                       620
#define TMR4ON                        621
#define T4OUTPS                       622
#define T4OUTPS0                      623
#define T4OUTPS1                      624
#define T4OUTPS2                      625
#define T4OUTPS3                      626
#define TMR6                          627
#define PR6                           628
#define T6CON                         629
#define T6CKPS0                       630
#define T6CKPS                        631
#define T6CKPS1                       632
#define TMR6ON                        633
#define T6OUTPS0                      634
#define T6OUTPS                       635
#define T6OUTPS1                      636
#define T6OUTPS2                      637
#define T6OUTPS3                      638
#define OPA1CON                       639
#define OPA1PCH                       640
#define OPA1PCH0                      641
#define OPA1PCH1                      642
#define OPA1UG                        643
#define OPA1SP                        644
#define OPA1EN                        645
#define OPA2CON                       646
#define OPA2PCH                       647
#define OPA2PCH0                      648
#define OPA2PCH1                      649
#define OPA2UG                        650
#define OPA2SP                        651
#define OPA2EN                        652
#define PWM3DCL0                      653
#define PWM3DCL                       654
#define PWM3DCL1                      655
#define PWM3DCH0                      656
#define PWM3DCH                       657
#define PWM3DCH1                      658
#define PWM3DCH2                      659
#define PWM3DCH3                      660
#define PWM3DCH4                      661
#define PWM3DCH5                      662
#define PWM3DCH6                      663
#define PWM3DCH7                      664
#define PWM3CON                       665
#define PWM3POL                       666
#define PWM3OUT                       667
#define PWM3EN                        668
#define PWM4DCL                       669
#define PWM4DCL0                      670
#define PWM4DCL1                      671
#define PWM4DCH0                      672
#define PWM4DCH                       673
#define PWM4DCH1                      674
#define PWM4DCH2                      675
#define PWM4DCH3                      676
#define PWM4DCH4                      677
#define PWM4DCH5                      678
#define PWM4DCH6                      679
#define PWM4DCH7                      680
#define PWM4CON                       681
#define PWM4POL                       682
#define PWM4OUT                       683
#define PWM4EN                        684
#define COG1PHR                       685
#define G1PHR                         686
#define G1PHR0                        687
#define G1PHR1                        688
#define G1PHR2                        689
#define G1PHR3                        690
#define G1PHR4                        691
#define G1PHR5                        692
#define COG1PHF                       693
#define G1PHF0                        694
#define G1PHF                         695
#define G1PHF1                        696
#define G1PHF2                        697
#define G1PHF3                        698
#define G1PHF4                        699
#define G1PHF5                        700
#define COG1BLKR                      701
#define G1BLKR                        702
#define G1BLKR0                       703
#define G1BLKR1                       704
#define G1BLKR2                       705
#define G1BLKR3                       706
#define G1BLKR4                       707
#define G1BLKR5                       708
#define COG1BLKF                      709
#define G1BLKF                        710
#define G1BLKF0                       711
#define G1BLKF1                       712
#define G1BLKF2                       713
#define G1BLKF3                       714
#define G1BLKF4                       715
#define G1BLKF5                       716
#define COG1DBR                       717
#define G1DBR0                        718
#define G1DBR                         719
#define G1DBR1                        720
#define G1DBR2                        721
#define G1DBR3                        722
#define G1DBR4                        723
#define G1DBR5                        724
#define COG1DBF                       725
#define G1DBF0                        726
#define G1DBF                         727
#define G1DBF1                        728
#define G1DBF2                        729
#define G1DBF3                        730
#define G1DBF4                        731
#define G1DBF5                        732
#define COG1CON0                      733
#define G1MD0                         734
#define G1MD                          735
#define G1MD1                         736
#define G1MD2                         737
#define G1CS0                         738
#define G1CS                          739
#define G1CS1                         740
#define G1LD                          741
#define G1EN                          742
#define COG1CON1                      743
#define G1POLA                        744
#define G1POLB                        745
#define G1POLC                        746
#define G1POLD                        747
#define G1FDBS                        748
#define G1RDBS                        749
#define COG1RIS                       750
#define G1RIS0                        751
#define G1RIS1                        752
#define G1RIS2                        753
#define G1RIS3                        754
#define G1RIS4                        755
#define G1RIS5                        756
#define G1RIS6                        757
#define COG1RSIM                      758
#define G1RSIM0                       759
#define G1RSIM1                       760
#define G1RSIM2                       761
#define G1RSIM3                       762
#define G1RSIM4                       763
#define G1RSIM5                       764
#define G1RSIM6                       765
#define COG1FIS                       766
#define G1FIS0                        767
#define G1FIS1                        768
#define G1FIS2                        769
#define G1FIS3                        770
#define G1FIS4                        771
#define G1FIS5                        772
#define G1FIS6                        773
#define COG1FSIM                      774
#define G1FSIM0                       775
#define G1FSIM1                       776
#define G1FSIM2                       777
#define G1FSIM3                       778
#define G1FSIM4                       779
#define G1FSIM5                       780
#define G1FSIM6                       781
#define COG1ASD0                      782
#define G1ASDAC0                      783
#define G1ASDAC                       784
#define G1ASDAC1                      785
#define G1ASDBD0                      786
#define G1ASDBD                       787
#define G1ASDBD1                      788
#define G1ARSEN                       789
#define G1ASE                         790
#define COG1ASD1                      791
#define G1AS0E                        792
#define G1AS1E                        793
#define G1AS2E                        794
#define G1AS3E                        795
#define COG1STR                       796
#define G1STRA                        797
#define G1STRB                        798
#define G1STRC                        799
#define G1STRD                        800
#define G1SDATA                       801
#define G1SDATB                       802
#define G1SDATC                       803
#define G1SDATD                       804
#define PPSLOCK                       805
#define PPSLOCKED                     806
#define INTPPS                        807
#define T0CKIPPS                      808
#define T1CKIPPS                      809
#define T1GPPS                        810
#define CCP1PPS                       811
#define CCP2PPS                       812
#define COGINPPS                      813
#define SSPCLKPPS                     814
#define SSPDATPPS                     815
#define SSPSSPPS                      816
#define RXPPS                         817
#define CKPPS                         818
#define CLCIN0PPS                     819
#define CLCIN1PPS                     820
#define CLCIN2PPS                     821
#define CLCIN3PPS                     822
#define RA0PPS                        823
#define RA1PPS                        824
#define RA2PPS                        825
#define RA4PPS                        826
#define RA5PPS                        827
#define RC0PPS                        828
#define RC1PPS                        829
#define RC2PPS                        830
#define RC3PPS                        831
#define RC4PPS                        832
#define RC5PPS                        833
#define CLCDATA                       834
#define MCLC1OUT                      835
#define MCLC2OUT                      836
#define MCLC3OUT                      837
#define CLC1CON                       838
#define CLC1CON_MODE                  839
#define LC1MODE0                      840
#define LC1MODE                       841
#define CLC1CON_MODE0                 842
#define LC1MODE1                      843
#define CLC1CON_MODE1                 844
#define CLC1CON_MODE2                 845
#define LC1MODE2                      846
#define LC1INTN                       847
#define CLC1CON_INTN                  848
#define LC1INTP                       849
#define CLC1CON_INTP                  850
#define CLC1CON_OUT                   851
#define LC1OUT                        852
#define LC1EN                         853
#define CLC1CON_EN                    854
#define CLC1POL                       855
#define LC1G1POL                      856
#define CLC1POL_G1POL                 857
#define CLC1POL_G2POL                 858
#define LC1G2POL                      859
#define LC1G3POL                      860
#define CLC1POL_G3POL                 861
#define LC1G4POL                      862
#define CLC1POL_G4POL                 863
#define CLC1POL_POL                   864
#define LC1POL                        865
#define CLC1SEL0                      866
#define CLC1SEL0_D1S0                 867
#define LC1D1S                        868
#define LC1D1S0                       869
#define CLC1SEL0_D1S                  870
#define CLC1SEL0_D1S1                 871
#define LC1D1S1                       872
#define CLC1SEL0_D1S2                 873
#define LC1D1S2                       874
#define CLC1SEL0_D1S3                 875
#define LC1D1S3                       876
#define CLC1SEL0_D1S4                 877
#define LC1D1S4                       878
#define CLC1SEL1                      879
#define CLC1SEL1_D2S0                 880
#define CLC1SEL1_D2S                  881
#define LC1D2S                        882
#define LC1D2S0                       883
#define CLC1SEL1_D2S1                 884
#define LC1D2S1                       885
#define LC1D2S2                       886
#define CLC1SEL1_D2S2                 887
#define LC1D2S3                       888
#define CLC1SEL1_D2S3                 889
#define LC1D2S4                       890
#define CLC1SEL1_D2S4                 891
#define CLC1SEL2                      892
#define LC1D3S0                       893
#define CLC1SEL2_D3S                  894
#define LC1D3S                        895
#define CLC1SEL2_D3S0                 896
#define LC1D3S1                       897
#define CLC1SEL2_D3S1                 898
#define LC1D3S2                       899
#define CLC1SEL2_D3S2                 900
#define LC1D3S3                       901
#define CLC1SEL2_D3S3                 902
#define LC1D3S4                       903
#define CLC1SEL2_D3S4                 904
#define CLC1SEL3                      905
#define CLC1SEL3_D4S                  906
#define LC1D4S                        907
#define LC1D4S0                       908
#define CLC1SEL3_D4S0                 909
#define CLC1SEL3_D4S1                 910
#define LC1D4S1                       911
#define LC1D4S2                       912
#define CLC1SEL3_D4S2                 913
#define LC1D4S3                       914
#define CLC1SEL3_D4S3                 915
#define LC1D4S4                       916
#define CLC1SEL3_D4S4                 917
#define CLC1GLS0                      918
#define CLC1GLS0_D1N                  919
#define LC1G1D1N                      920
#define CLC1GLS0_D1T                  921
#define LC1G1D1T                      922
#define LC1G1D2N                      923
#define CLC1GLS0_D2N                  924
#define LC1G1D2T                      925
#define CLC1GLS0_D2T                  926
#define CLC1GLS0_D3N                  927
#define LC1G1D3N                      928
#define CLC1GLS0_D3T                  929
#define LC1G1D3T                      930
#define CLC1GLS0_D4N                  931
#define LC1G1D4N                      932
#define CLC1GLS0_D4T                  933
#define LC1G1D4T                      934
#define CLC1GLS1                      935
#define CLC1GLS1_D1N                  936
#define LC1G2D1N                      937
#define LC1G2D1T                      938
#define CLC1GLS1_D1T                  939
#define CLC1GLS1_D2N                  940
#define LC1G2D2N                      941
#define LC1G2D2T                      942
#define CLC1GLS1_D2T                  943
#define CLC1GLS1_D3N                  944
#define LC1G2D3N                      945
#define LC1G2D3T                      946
#define CLC1GLS1_D3T                  947
#define CLC1GLS1_D4N                  948
#define LC1G2D4N                      949
#define LC1G2D4T                      950
#define CLC1GLS1_D4T                  951
#define CLC1GLS2                      952
#define CLC1GLS2_D1N                  953
#define LC1G3D1N                      954
#define LC1G3D1T                      955
#define CLC1GLS2_D1T                  956
#define LC1G3D2N                      957
#define CLC1GLS2_D2N                  958
#define LC1G3D2T                      959
#define CLC1GLS2_D2T                  960
#define CLC1GLS2_D3N                  961
#define LC1G3D3N                      962
#define LC1G3D3T                      963
#define CLC1GLS2_D3T                  964
#define LC1G3D4N                      965
#define CLC1GLS2_D4N                  966
#define LC1G3D4T                      967
#define CLC1GLS2_D4T                  968
#define CLC1GLS3                      969
#define LC1G4D1N                      970
#define CLC1GLS3_G4D1N                971
#define LC1G4D1T                      972
#define CLC1GLS3_G4D1T                973
#define CLC1GLS3_G4D2N                974
#define LC1G4D2N                      975
#define CLC1GLS3_G4D2T                976
#define LC1G4D2T                      977
#define LC1G4D3N                      978
#define CLC1GLS3_G4D3N                979
#define LC1G4D3T                      980
#define CLC1GLS3_G4D3T                981
#define CLC1GLS3_G4D4N                982
#define LC1G4D4N                      983
#define CLC1GLS3_G4D4T                984
#define LC1G4D4T                      985
#define CLC2CON                       986
#define LC2MODE0                      987
#define CLC2CON_MODE                  988
#define LC2MODE                       989
#define CLC2CON_MODE0                 990
#define LC2MODE1                      991
#define CLC2CON_MODE1                 992
#define LC2MODE2                      993
#define CLC2CON_MODE2                 994
#define LC2INTN                       995
#define CLC2CON_INTN                  996
#define LC2INTP                       997
#define CLC2CON_INTP                  998
#define CLC2CON_OUT                   999
#define LC2OUT                        1000
#define CLC2CON_EN                    1001
#define LC2EN                         1002
#define CLC2POL                       1003
#define LC2G1POL                      1004
#define CLC2POL_G1POL                 1005
#define LC2G2POL                      1006
#define CLC2POL_G2POL                 1007
#define LC2G3POL                      1008
#define CLC2POL_G3POL                 1009
#define LC2G4POL                      1010
#define CLC2POL_G4POL                 1011
#define CLC2POL_POL                   1012
#define LC2POL                        1013
#define CLC2SEL0                      1014
#define CLC2SEL0_D1S                  1015
#define LC2D1S0                       1016
#define CLC2SEL0_D1S0                 1017
#define LC2D1S                        1018
#define LC2D1S1                       1019
#define CLC2SEL0_D1S1                 1020
#define LC2D1S2                       1021
#define CLC2SEL0_D1S2                 1022
#define CLC2SEL0_D1S3                 1023
#define LC2D1S3                       1024
#define LC2D1S4                       1025
#define CLC2SEL0_D1S4                 1026
#define CLC2SEL1                      1027
#define LC2D2S0                       1028
#define CLC2SEL1_D2S0                 1029
#define LC2D2S                        1030
#define CLC2SEL1_D2S                  1031
#define LC2D2S1                       1032
#define CLC2SEL1_D2S1                 1033
#define LC2D2S2                       1034
#define CLC2SEL1_D2S2                 1035
#define LC2D2S3                       1036
#define CLC2SEL1_D2S3                 1037
#define LC2D2S4                       1038
#define CLC2SEL1_D2S4                 1039
#define CLC2SEL2                      1040
#define CLC2SEL2_D3S                  1041
#define LC2D3S0                       1042
#define CLC2SEL2_D3S0                 1043
#define LC2D3S                        1044
#define CLC2SEL2_D3S1                 1045
#define LC2D3S1                       1046
#define LC2D3S2                       1047
#define CLC2SEL2_D3S2                 1048
#define LC2D3S3                       1049
#define CLC2SEL2_D3S3                 1050
#define LC2D3S4                       1051
#define CLC2SEL2_D3S4                 1052
#define CLC2SEL3                      1053
#define LC2D4S                        1054
#define LC2D4S0                       1055
#define CLC2SEL3_D4S                  1056
#define CLC2SEL3_D4S0                 1057
#define LC2D4S1                       1058
#define CLC2SEL3_D4S1                 1059
#define LC2D4S2                       1060
#define CLC2SEL3_D4S2                 1061
#define CLC2SEL3_D4S3                 1062
#define LC2D4S3                       1063
#define LC2D4S4                       1064
#define CLC2SEL3_D4S4                 1065
#define CLC2GLS0                      1066
#define LC2G1D1N                      1067
#define CLC2GLS0_D1N                  1068
#define CLC2GLS0_D1T                  1069
#define LC2G1D1T                      1070
#define LC2G1D2N                      1071
#define CLC2GLS0_D2N                  1072
#define CLC2GLS0_D2T                  1073
#define LC2G1D2T                      1074
#define LC2G1D3N                      1075
#define CLC2GLS0_D3N                  1076
#define CLC2GLS0_D3T                  1077
#define LC2G1D3T                      1078
#define LC2G1D4N                      1079
#define CLC2GLS0_D4N                  1080
#define CLC2GLS0_D4T                  1081
#define LC2G1D4T                      1082
#define CLC2GLS1                      1083
#define CLC2GLS1_D1N                  1084
#define LC2G2D1N                      1085
#define CLC2GLS1_D1T                  1086
#define LC2G2D1T                      1087
#define CLC2GLS1_D2N                  1088
#define LC2G2D2N                      1089
#define CLC2GLS1_D2T                  1090
