tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1705_tdd.h
#define LC2G2D2T                      1091
#define LC2G2D3N                      1092
#define CLC2GLS1_D3N                  1093
#define LC2G2D3T                      1094
#define CLC2GLS1_D3T                  1095
#define LC2G2D4N                      1096
#define CLC2GLS1_D4N                  1097
#define LC2G2D4T                      1098
#define CLC2GLS1_D4T                  1099
#define CLC2GLS2                      1100
#define LC2G3D1N                      1101
#define CLC2GLS2_D1N                  1102
#define CLC2GLS2_D1T                  1103
#define LC2G3D1T                      1104
#define CLC2GLS2_D2N                  1105
#define LC2G3D2N                      1106
#define LC2G3D2T                      1107
#define CLC2GLS2_D2T                  1108
#define CLC2GLS2_D3N                  1109
#define LC2G3D3N                      1110
#define CLC2GLS2_D3T                  1111
#define LC2G3D3T                      1112
#define CLC2GLS2_D4N                  1113
#define LC2G3D4N                      1114
#define LC2G3D4T                      1115
#define CLC2GLS2_D4T                  1116
#define CLC2GLS3                      1117
#define LC2G4D1N                      1118
#define CLC2GLS3_G4D1N                1119
#define CLC2GLS3_G4D1T                1120
#define LC2G4D1T                      1121
#define CLC2GLS3_G4D2N                1122
#define LC2G4D2N                      1123
#define LC2G4D2T                      1124
#define CLC2GLS3_G4D2T                1125
#define CLC2GLS3_G4D3N                1126
#define LC2G4D3N                      1127
#define CLC2GLS3_G4D3T                1128
#define LC2G4D3T                      1129
#define LC2G4D4N                      1130
#define CLC2GLS3_G4D4N                1131
#define CLC2GLS3_G4D4T                1132
#define LC2G4D4T                      1133
#define CLC3CON                       1134
#define LC3MODE0                      1135
#define CLC3CON_MODE0                 1136
#define CLC3CON_MODE                  1137
#define LC3MODE                       1138
#define LC3MODE1                      1139
#define CLC3CON_MODE1                 1140
#define LC3MODE2                      1141
#define CLC3CON_MODE2                 1142
#define LC3INTN                       1143
#define CLC3CON_INTN                  1144
#define CLC3CON_INTP                  1145
#define LC3INTP                       1146
#define CLC3CON_OUT                   1147
#define LC3OUT                        1148
#define LC3EN                         1149
#define CLC3CON_EN                    1150
#define CLC3POL                       1151
#define LC3G1POL                      1152
#define CLC3POL_G1POL                 1153
#define LC3G2POL                      1154
#define CLC3POL_G2POL                 1155
#define CLC3POL_G3POL                 1156
#define LC3G3POL                      1157
#define LC3G4POL                      1158
#define CLC3POL_G4POL                 1159
#define LC3POL                        1160
#define CLC3POL_POL                   1161
#define CLC3SEL0                      1162
#define CLC3SEL0_D1S0                 1163
#define LC3D1S0                       1164
#define LC3D1S                        1165
#define CLC3SEL0_D1S                  1166
#define LC3D1S1                       1167
#define CLC3SEL0_D1S1                 1168
#define LC3D1S2                       1169
#define CLC3SEL0_D1S2                 1170
#define LC3D1S3                       1171
#define CLC3SEL0_D1S3                 1172
#define LC3D1S4                       1173
#define CLC3SEL0_D1S4                 1174
#define CLC3SEL1                      1175
#define CLC3SEL1_D2S                  1176
#define CLC3SEL1_D2S0                 1177
#define LC3D2S                        1178
#define LC3D2S0                       1179
#define CLC3SEL1_D2S1                 1180
#define LC3D2S1                       1181
#define CLC3SEL1_D2S2                 1182
#define LC3D2S2                       1183
#define CLC3SEL1_D2S3                 1184
#define LC3D2S3                       1185
#define LC3D2S4                       1186
#define CLC3SEL1_D2S4                 1187
#define CLC3SEL2                      1188
#define CLC3SEL2_D3S0                 1189
#define LC3D3S                        1190
#define CLC3SEL2_D3S                  1191
#define LC3D3S0                       1192
#define LC3D3S1                       1193
#define CLC3SEL2_D3S1                 1194
#define LC3D3S2                       1195
#define CLC3SEL2_D3S2                 1196
#define LC3D3S3                       1197
#define CLC3SEL2_D3S3                 1198
#define LC3D3S4                       1199
#define CLC3SEL2_D3S4                 1200
#define CLC3SEL3                      1201
#define CLC3SEL3_D4S0                 1202
#define LC3D4S0                       1203
#define LC3D4S                        1204
#define CLC3SEL3_D4S                  1205
#define LC3D4S1                       1206
#define CLC3SEL3_D4S1                 1207
#define LC3D4S2                       1208
#define CLC3SEL3_D4S2                 1209
#define LC3D4S3                       1210
#define CLC3SEL3_D4S3                 1211
#define LC3D4S4                       1212
#define CLC3SEL3_D4S4                 1213
#define CLC3GLS0                      1214
#define CLC3GLS0_D1N                  1215
#define LC3G1D1N                      1216
#define LC3G1D1T                      1217
#define CLC3GLS0_D1T                  1218
#define LC3G1D2N                      1219
#define CLC3GLS0_D2N                  1220
#define CLC3GLS0_D2T                  1221
#define LC3G1D2T                      1222
#define CLC3GLS0_D3N                  1223
#define LC3G1D3N                      1224
#define LC3G1D3T                      1225
#define CLC3GLS0_D3T                  1226
#define CLC3GLS0_D4N                  1227
#define LC3G1D4N                      1228
#define CLC3GLS0_D4T                  1229
#define LC3G1D4T                      1230
#define CLC3GLS1                      1231
#define LC3G2D1N                      1232
#define CLC3GLS1_D1N                  1233
#define CLC3GLS1_D1T                  1234
#define LC3G2D1T                      1235
#define LC3G2D2N                      1236
#define CLC3GLS1_D2N                  1237
#define LC3G2D2T                      1238
#define CLC3GLS1_D2T                  1239
#define LC3G2D3N                      1240
#define CLC3GLS1_D3N                  1241
#define CLC3GLS1_D3T                  1242
#define LC3G2D3T                      1243
#define LC3G2D4N                      1244
#define CLC3GLS1_D4N                  1245
#define LC3G2D4T                      1246
#define CLC3GLS1_D4T                  1247
#define CLC3GLS2                      1248
#define LC3G3D1N                      1249
#define CLC3GLS2_D1N                  1250
#define LC3G3D1T                      1251
#define CLC3GLS2_D1T                  1252
#define CLC3GLS2_D2N                  1253
#define LC3G3D2N                      1254
#define CLC3GLS2_D2T                  1255
#define LC3G3D2T                      1256
#define CLC3GLS2_D3N                  1257
#define LC3G3D3N                      1258
#define LC3G3D3T                      1259
#define CLC3GLS2_D3T                  1260
#define CLC3GLS2_D4N                  1261
#define LC3G3D4N                      1262
#define CLC3GLS2_D4T                  1263
#define LC3G3D4T                      1264
#define CLC3GLS3                      1265
#define LC3G4D1N                      1266
#define CLC3GLS3_G4D1N                1267
#define LC3G4D1T                      1268
#define CLC3GLS3_G4D1T                1269
#define LC3G4D2N                      1270
#define CLC3GLS3_G4D2N                1271
#define CLC3GLS3_G4D2T                1272
#define LC3G4D2T                      1273
#define LC3G4D3N                      1274
#define CLC3GLS3_G4D3N                1275
#define CLC3GLS3_G4D3T                1276
#define LC3G4D3T                      1277
#define LC3G4D4N                      1278
#define CLC3GLS3_G4D4N                1279
#define LC3G4D4T                      1280
#define CLC3GLS3_G4D4T                1281
#define ICDBK0H                       1282
#define BKA8                          1283
#define BKA9                          1284
#define BKA10                         1285
#define BKA11                         1286
#define BKA12                         1287
#define BKA13                         1288
#define BKA14                         1289
#define STATUS_SHAD                   1290
#define C_SHAD                        1291
#define DC_SHAD                       1292
#define Z_SHAD                        1293
#define WREG_SHAD                     1294
#define BSR_SHAD                      1295
#define PCLATH_SHAD                   1296
#define FSR0L_SHAD                    1297
#define FSR0H_SHAD                    1298
#define FSR1L_SHAD                    1299
#define FSR1H_SHAD                    1300
#define STKPTR                        1301
#define TOSL                          1302
#define TOSH                          1303

#endif // _PIC16LF1705_H_
